


question_flow = {
    "Тип шахты": {
        "question": "Выберите тип шахты",
        "type": "select",
        "options": ["вытяжная", "приточная активная", "приточная пассивная", "приточная с подмешиванием"]
    },
    "Диаметр": {
        "question": "Укажите диаметр шахты",
        "type": "select",
        "options": ["560", "710", "800"],
        "depends_on": {"Тип шахты": ["вытяжная", "приточная активная", "приточная пассивная", "приточная с подмешиванием"]}
    },
    "Тип клапана": {
        "question": "Выберите тип клапана",
        "type": "select",
        "options": ["поворотный", "гравитационный", "двустворчатый", "без клапана"],
        "depends_on": {"Тип шахты": ["вытяжная", "приточная пассивная"]}
    },
    "Тип мотора": {
        "question": "Выберите тип мотора",
        "type": "select",
        "options": ["6D", "6E"],
        "depends_on": {"Тип шахты": ["вытяжная", "приточная активная", "приточная с подмешиванием"], "Тип клапана": ["поворотный"]}
    },
    "Мощность мотора": {
        "question": "Укажите мощность мотора",
        "type": "select",
        "options": ["370", "750"],
        "depends_on": {"Тип мотора": ["6D", "6E"]}
    },
    "Расположение клапана": {
        "question": "Где расположен клапан?",
        "type": "select",
        "options": ["верх", "низ"],
        "depends_on": {"Тип клапана": ["поворотный"]}
    },
    "Верхняя часть": {
        "question": "Выберите верхнюю часть",
        "type": "select",
        "options": ["зонт", "раструб"],
        "depends_on": {"Тип шахты": ["вытяжная", "приточная активная", "приточная пассивная"]}
    },
    "Герметизация": {
        "question": "Требуется ли герметизация?",
        "type": "select",
        "options": ["да", "нет"]
    },
    "Автомат защиты": {
        "question": "Добавить автомат защиты?",
        "type": "select",
        "options": ["да", "нет"],
        "depends_on": {"Тип клапана": ["поворотный"]}
    },
    "Каплеулавливатель": {
        "question": "Нужен ли каплеулавливатель?",
        "type": "select",
        "options": ["да", "нет"],
        "depends_on": {"Тип шахты": ["вытяжная", "приточная активная", "приточная пассивная"]}
    },
    "Удлинение": {
        "question": "Нужно ли удлинение?",
        "type": "select",
        "options": ["да", "нет"]
    },
    "Итоговая длина шахты (м)": {
        "question": "Укажите итоговую длину шахты в метрах",
        "type": "input",
        "input_type": "int"
    },
    "Активная / пассивная (для приточной)": {
        "question": "Тип приточной шахты",
        "type": "select",
        "options": ["активная", "пассивная"],
        "depends_on": {"Тип шахты": ["приточная активная", "приточная пассивная"]}
    },
    "Подмешивание": {
        "question": "Нужно ли подмешивание?",
        "type": "select",
        "options": ["да", "нет"],
        "depends_on": {"Тип шахты": ["приточная с подмешиванием"]}
    }
}